# SetFenceAttrs

## Description
Applies fence attributes to input handle.

```pascal
PROCEDURE SetFenceAttrs(fFenceHandle : HANDLE);
```

```python

def vs.SetFenceAttrs(fFenceHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fFenceHandle|HANDLE||

## Version
Availability: from Vectorworks 2015
## Category
* SiteModel Interface Library